import random
xrc=["nb","智慧","爱看电视","狂笑","人类","真正","笨笨","开心",
     "垃圾","爱吃饭"]
rw=["人类","程序猿","ikun","只因","散蛇","石头","骨头","飞机",
    "大肠","电脑","猴子"]
dc=["砸","锤","吹","吃","拉","修","批","劈","看",
    "砍","射","喷","飞","洗","吸","12345"]
sw=["人类","程序猿","ikun","只因","散蛇","石头","骨头","飞机","大肠",
    "电脑","猴子","shit","史","石","屎","niao","monkey","圣金","煞笔"]
bi=["A","B","C","D","E","F","G","H","I","J","K","L","M","N","O","P","Q","R","S","T","U","V","W","X","Y","Z",
   "a","b","c","d","e","f","g","h","i","j","k","l","m","n","o","p","q","r","s","t","u","v","w","x","y","z",
   "1","2","3","4","5","6","7","8","9","0","`","~","!","@","#","$","%","^","&","*","(",")","-","_","=","+",
   "[","]","{","}",";",":","'","\"","\\","|",",",".","<",">","/","?"]
while True:
    input()
    print(xrc[random.randint(0,len(xrc)-1)],end="")
    print("的",end="")
    print(rw[random.randint(0,len(rw)-1)],end="")
    print(dc[random.randint(0,len(dc)-1)],end="")
    print(sw[random.randint(0,len(sw)-1)],end="")
    for i in range(10):
        print(bi[random.randint(0,len(bi)-1)],end="")
    print()
